if [ ! -d 'Lab 2 repo' ]
then
mkdir 'Lab 2 repo'
cd 'Lab 2 repo'
git init
git config --local alias.hist "log --pretty=format:'%h %ad | %s%d [%an]' --graph --date=short"
else
cd 'Lab 2 repo'
fi
touch essay.txt
git add .
git commit -m "Added essay.txt"
echo "	Будущее человека во многом зависит от выбранной профессии. С этой проблемой сталкиваются практически все школьники, ведь от того, каким будет этот выбор, зависит вся дальнейшая жизнь. Ученики 9 и 11 классов находятся на жизненном распутье: детство заканчивается и начинается взрослая жизнь. Для того, чтобы не сбиться с жизненного пути, надо поставить перед собой цель. Ответ на этот вопрос поможет верно выбрать не только специальность, но и ВУЗ." > essay.txt
git add .
git commit -m "Added 1 paragraph"
echo "	Моими любимыми предметами в школе были математика, физика и, конечно, информатика. Именно поэтому я не сомневался в том, что хочу связать свою жизнь с компьютерами. Я думаю, что профессия программиста предоставляет много возможностей. Компьютеры являются самой быстро меняющейся сферой современной технологии. Сегодня мы живем в век информации. И я думаю, что будущее принадлежит компьютерам. Здесь необходимо уметь быстро находить правильное и кратчайшее решение, находить и исправлять допущенные ошибки. Кроме того, создатели программного обеспечения для персональных компьютеров, планшетов, сотовых телефонов и прочих устройств, без которых жизнь современного человека не имеет смысла, должны сделать свою продукцию не только правильно работающей, но и привлекательной для пользователя." >> essay.txt
git add .
git commit -m "Added 2 paragraph"
echo "	Я выбрал специальность ""Искусственный интеллект"", потому что считаю, что будущее за автоматизацией и хотел бы принять непосредственное участие в его создании. Также немаловажную роль сыграл и перечень изучаемых здесь дисциплин. Многие хотят изучать геймдизайн, но меня не привлекает такая специализация ввиду своей узкой направленности. Как однажды отметил Роберт Хайнлайн, человек должен уметь делать всё. Поэтому более универсальная специальность - это мой выбор. Свою роль в моём выборе сыграла и достаточно высокая зарплата." >> essay.txt
git add .
git commit -m "Added 3 paragraph"
echo "	При выборе профессии очень удобно составлять сравнительную характеристику её плюсов и минусов." >> essay.txt
git add .
git commit -m "Added 4 paragraph"
echo "	Самый главный минус, на мой взгляд, - долгая работа за компьютером может пагубно сказаться на здоровье. Хотя с другой стороны, мы и так проводим много времени за компьютером, тогда почему бы не направить свои силы в верное русло. Вторым существенным минусом является то, что на данный момент количество программистов достаточно большое, что может вызвать некоторые трудности с поиском работы." >> essay.txt
git add .
git commit -m "Added 5 paragraph"
echo "	Здесь мы и переходим к плюсам. Работа достаточно творческая, и творить можно все, что придет в голову тебе или заказчику. Одновременно она обладает исключительной социальной ценностью. Ведь мало кто сегодня представляет свою жизнь без компьютера. Постоянное самосовершенствование, непрерывное движение вперед. Эта наука на месте не стоит, постоянно развивается и преобразовывается, появляется все новая и новая информация, так что необходимо изо дня в день держать руку на пульсе времени, не отставать. Специалисту в области прикладных IT-технологий однозначно не грозит безработица, так как в ближайшей перспективе программирование будет пользоваться возрастающим спросом. И последний, но также значимый, это новые знакомства с единомышленниками и просто интересными людьми. Таким образом, список плюсов полностью закрывает, минусы." >> essay.txt
git add .
git commit -m "Added 6 paragraph"
echo "	Учитывая всё вышесказанное, именно поэтому я и выбрал ""Искусственный интеллект""." >> essay.txt
git add .
git commit -m "Added 7 paragraph"
git hist
notepad essay.txt
#git remote add origin https://github.com/VasKho/Lab-2.git
#git push origin master
cd ..
mkdir 'Repo copy'
cd 'Repo copy'
git clone 'F:\TIIT Labs\Lab 2\Lab 2 repo'
read -s -n 1 -p "Press any key to continue..."
